app/views/registrations/course_registration.html.erb

          <td>
            <% lecture = current_user.enrollments.joins(:lecture).find_by(lectures: { day: day, period: "#{period}限", semester: '前期' }) %>
---
SELECT "enrollments".* FROM "enrollments" INNER JOIN "lectures" ON "lectures"."id" = "enrollments"."lecture_id" WHERE "enrollments"."user_id" = ? AND "lectures"."day" = ? AND "lectures"."period" = ? AND "lectures"."semester" = ? LIMIT ?  [["user_id", 1], ["day", "月曜日"], ["period", "1限"], ["semester", "前期"], ["LIMIT", 1]]

          <td>
            <% lecture = current_user.enrollments.joins(:lecture).find_by(lectures: { day: day, period: "#{period}限", semester: '後期' }) %>
---
SELECT "enrollments".* FROM "enrollments" INNER JOIN "lectures" ON "lectures"."id" = "enrollments"."lecture_id" WHERE "enrollments"."user_id" = ? AND "lectures"."day" = ? AND "lectures"."period" = ? AND "lectures"."semester" = ? LIMIT ?  [["user_id", 1], ["day", "月曜日"], ["period", "1限"], ["semester", "後期"], ["LIMIT", 1]]