app/views/home/top.html.erb

          <td>
            <% lectures = Lecture.where(day: day, period: "#{period}限", semester: '前期') %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."day" = ? AND "lectures"."period" = ? AND "lectures"."semester" = ? LIMIT ?  [["day", "月曜日"], ["period", "1限"], ["semester", "前期"], ["LIMIT", 1]]

          <td>
            <% lectures = Lecture.where(day: day, period: "#{period}限", semester: '後期') %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."day" = ? AND "lectures"."period" = ? AND "lectures"."semester" = ?  [["day", "月曜日"], ["period", "1限"], ["semester", "後期"]]