app/views/enrollments/edit.html.erb


<% lectures = Lecture.where(day: @enrollment.lecture.day, period: @enrollment.lecture.period, semester: @enrollment.lecture.semester) %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."day" = ? AND "lectures"."period" = ? AND "lectures"."semester" = ?  [["day", "水曜日"], ["period", "3限"], ["semester", "前期"]]