app/views/enrollments/new.html.erb


<% lectures = Lecture.where(day: params[:day], period: params[:period], semester: params[:semester]) %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."day" = ? AND "lectures"."period" = ? AND "lectures"."semester" = ?  [["day", "月曜日"], ["period", "1限"], ["semester", "前期"]]