app/controllers/enrollments_controller.rb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @enrollment = Enrollment.find(params[:id])

INSERT INTO "enrollments" ("user_id", "lecture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["lecture_id", 3], ["created_at", "2024-07-08 08:37:30.328836"], ["updated_at", "2024-07-08 08:37:30.328836"]]
---
  def create
    @enrollment = Enrollment.new(enrollment_params)
    @enrollment.user = current_user

    if @enrollment.save

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @enrollment = Enrollment.find(params[:id])

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "enrollments" SET "lecture_id" = ?, "updated_at" = ? WHERE "enrollments"."id" = ?  [["lecture_id", 8], ["updated_at", "2024-07-08 09:55:20.738829"], ["id", 6]]
---
  def update
    @enrollment = Enrollment.find(params[:id])

    if @enrollment.update(enrollment_params)

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "enrollments" WHERE "enrollments"."id" = ?  [["id", 4]]
---
  def destroy
    @enrollment = Enrollment.find(params[:id])
    @enrollment.destroy