app/controllers/lectures_controller.rb

  def show
    @lecture = Lecture.find(params[:id])
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]